Repository: androscodemo/AndrosCodemo-CV
Catalog: AndrosCodemoCV/Utilities/*.lproj/HomeModuleStrings.strings
Languages: es

source: Contact
es: Contacto

source: Welcome
es: Bienvenido

source: Present
es: Actualidad

source: years old
es: años de edad

source: Free union
es: Unión libre

source: My two daughters
es: Mis dos hijas

source: About this project
es: Sobre este proyecto

source: Past experience
es: Experiencia profesional

source: Professional summary
es: Resumen profesional

source: Personal information
es: Información personal

source: Topics of knowledge
es: Áreas de conocimiento

source: Computer Science Engineer
es: Ingeniero en Ciencias de la Computación

source: The only iOS developer. I was in charge of the development and deployment of the applications to TestFlight. Mostly worked with UIKit, Autolayout, CoreBluetooth and Alamofire.
es: Único desarrollador de iOS. Estaba a cargo del desarrollo y la liberacion de las aplicaciones en la AppStore. Trabajé principalmente con los Frameworks UIKit, Autolayour, CoreBluetooth y Alamofire.

source: In charge of the software development. Developed an iPad application to control a neurostimulation room over Bluetooth.
es: A cargo del desarrollo de software. Desarrollé una aplicación para iPad que controla un cuarto de neuroestimulación a través de Bluethoot.

source: Part of a small development team. Mostly worked with UIKit, Autolayout, Alamofire, CoreData, CoreLocation, AVFoundation.
es: Parte de un pequeño equipo de desarrollo. Trabajé principalmente con los Frameworks UIKit, Autolayout, Alamofire, CoreData, CoreLocation, AVFoundation.

source: Part of a big development team. I am in charge of the development and validation of the new application. Also I help the team to get used to the programming language Swift.
es: Parte de un equipo de desarrollo grande. Estoy a cargo del desarrollo y validación de la nueva aplicación. También ayudo al equipo a con los problemas que llegan a tener con el lenguaje de programación Swift.

source: Graduated from the Benemérita Universidad Autónoma de Puebla (BUAP) as a Computer Science Engineer. I worked on some StartUps where I managed to familiarize myself with the Swift language and Apple's guidelines, both for the development and deploiment of applications. As the only developer in some of those StartUps I had the opportunity to work with many of the Frameworks that Apple has to offer. Upon entering Banco Azteca I managed to share my development experience with the iOS team and substantially improved my skills as a leader.
es: Egresado de la Benemérita Universidad Autónoma de Puebla (BUAP) como Ingeniero en Ciencias de la Computación Trabajé en algunas StartUps donde logré familiarizarme con el lenguaje Swift y los lineamientos de Apple, tanto para el desarrollo de aplicaciones como para su despliegue. Como único desarrollador en algunas de esas StartUps tuve la oportunidad de trabajar con muchos de los Frameworks que Apple ofrece. Al entrar a Banco Azteca logré compartir mi experiencia de desarrollo con el equipo de iOS y mejoré sustancialmente mis habilidades como líder.
